<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>

  <section id="about" name="about">
    <div id="intro">
      <div class="container">
        <div class="row">

          <div class="col-lg-2 col-lg-offset-1">
            <h5>소개합니다.</h5>
          </div>
          <div id="int" class="col-lg-6">
<!-- 			<div id="intro"> -->

<!-- 				<p><strong>"적극, 신뢰, 탐구적인 자세를 갖춘 개발자 "</strong></p> -->
<!-- 				<p>적극적인 사람이 되고자 다양한 활동을 시작했습니다. 학부생 시절, 부학생회장에 선출되어 학내외 행사를 성공적으로 이끈 경험이 있습니다. 이후 웹 프로젝트를 기획하며 학술제에 입상하여 동상을 받기도 했습니다. 이를 통해 적극적이고 주도적인 자세는 다양한 경험과 성장의 발판이 된다는 것을 깨달았습니다. </p> -->
<!-- 				<p>이후 ‘신뢰할 수 있는 사람이 되자’는 목표가 생겼습니다. 주변에서 인정과 신뢰를 받음으로써 좋은 관계를 유지 할 수 있었고, 그에 보답하고자 자연스럽게 성실하고 책임감을 갖춘 사람이 될 수 있었습니다.</p> -->
<!-- 				<p>앞으로는 개발자로 성장하기 위해 자만하지 않고 탐구 습관을 지닐 것입니다. 개발지식을 내 것으로 만들며, 새로운 기술을 끊임없이 탐구하는 모습이야말로 성장하는 개발자의 참된 모습이라고 생각합니다. 이를 실천하기 위해 github을 주로 애용하여 테스트 프로그램 작성하며 개발자로서 성장을 다지고 있습니다.</p> -->
				
				<p><strong>"적극, 신뢰, 탐구적인 자세를 갖춘 개발자 "</strong></p>
				<p>2년차 개발자, 1년차 백수 생활을 하고 있는 박홍순입니다. </p>
				<p>취업하고 싶어서 이 웹을 만들었습니다. 저 좀 데려가주실 천사분을 찾습니다. </p>
				<p>연락주세용</p>
<!-- 			</div> -->
          </div>
            <p><a href="#"><i class="icon-file"></i></a>
              <sm><a href="#introduce" class="" data-toggle="modal">자기소개서 열람</a>  &nbsp;<span class="glyphicon glyphicon-search"></span></sm>
            </p>
          </div>
          
          <!-- Modal -->
           <div id="introduce" class="modal">
		     <div class="modal-dialog">
		          <div class="modal-content">
		               <div class="modal-header">
		                    <button type="button" class="close" data-dismiss="modal" aria-hidden="true">&times;</button>
		                    <h4 class="modal-title">자기소개서<a href="<c:url value='/resources/박홍순_자기소개서.pdf'/> "><small>( pdf&nbsp;<span class="glyphicon glyphicon-floppy-disk"></span> )</small></a></h4>
		               </div>
		               <div class="modal-body">
		               		<p><span>1. 본인의 과거, 현재, 미래를 표현할 수 있는 각각의 키워드를 선정하고 그 이유를 서술하여 주십시오.</span></p>	
		               		<p><strong>"적극, 신뢰, 탐구적인 자세를 갖춘 개발자 "</strong></p>
		                    <p>적극적인 사람이 되고자 다양한 활동을 시작했습니다. 학부생 시절, 부학생회장에 선출되어 학내외 행사를 성공적으로 이끈 경험이 있습니다. 이후 웹 프로젝트를 기획하며 학술제에 입상하여 동상을 받기도 했습니다. 이를 통해 적극적이고 주도적인 자세는 다양한 경험과 성장의 발판이 된다는 것을 깨달았습니다. </p>
		                    <p>이후 ‘신뢰할 수 있는 사람이 되자’는 목표가 생겼습니다. 주변에서 인정과 신뢰를 받음으로써 좋은 관계를 유지 할 수 있었고, 그에 보답하고자 자연스럽게 성실하고 책임감을 갖춘 사람이 될 수 있었습니다.</p>
		                    <p>앞으로는 개발자로 성장하기 위해 자만하지 않고 탐구 습관을 지닐 것입니다. 개발지식을 내 것으로 만들며, 새로운 기술을 끊임없이 탐구하는 모습이야말로 성장하는 개발자의 참된 모습이라고 생각합니다. 이를 실천하기 위해 github을 주로 애용하여 테스트 프로그램 작성하며 개발자로서 성장을 다지고 있습니다.</p>
		                    
		                    <hr/>
		                    
		                    <p><span>2. 해당직무에 지원한 동기는 무엇이고, 본인이 지원직무에 적합하다고 생각하는 이유를 인성적, 직무적 관점에서 설명해주십시오.</span></p>
		                    <p><strong>"탐구와 열정"</strong></p>
		                    <p>컴퓨터 정보공학과에 진학하며 팀 프로젝트를 통해 '자전거를 활용한 다이어트' 웹 애플리케이션을 만들게 되었습니다. 이 과정에서 시스템을 구축하고, 사용자들에게 서비스 제공하는 과정이 매우 흥미로웠고, 성취감을 느낄 수 있었습니다. 사용자 중심의 서비스를 만들어내며, 보다 효율적으로 보완하는 과정이 저에게 열정과 흥미를 갖게 합니다. 
SW개발 직무를 통해 저의 열정을 추구하며 성장하고, 회사에 긍정적인 영향을 주고 싶어 해당 직무에 지원하게 되었습니다.</p>
							<p><strong>"개발자로서의 기초 역량과 소통능력"</strong></p>
		                    <p>개발자가 되기 위해 체계적이고 전문적인 교육을 받았습니다. 방송 국제교육원에서 진행하는 초급 개발자 양성을 위한 정보시스템 개발과정을 이수하였습니다. 기초를 바탕으로 2년간 기업의 ERP 및 홈페이지 관리, SI 프로젝트 지원을 통해 기초를 쌓았습니다. 이러한 경험을 통해 직무를 수행하기 위한 지식과 역량을 갖추는 데 도움이 되었습니다. </p>
		                    <p>업무를 성공적으로 수행하기 위해 충분한 소통 능력이 필요하다고 생각합니다. 저는 평소에 사람과의 관계를 중시합니다. 혼자보다 함께하는 순간이 즐겁고 더욱 다양한 상황을 경험할 수 있기 때문입니다. 그 때문에 학창시절엔 학생회 활동을 하며 학우들과 소통했고, 회사 재직시절엔 팀원들과 협업을 통해 업무를 성공적으로 수행했습니다. 이 때문에 제가 소통과 협업이 필요한 해당 직무를 수행하기에 적합하다고 생각합니다.</p>
		                    
		                    <hr/>
		                    <p><span>3. 인생에서 '가장 힘들었던 경험 및 이를 극복해 나간 과정'에 대해서 기술하고, 이를 통해 얻은 교훈이 무엇인지 서술해주십시오.</span></p>
		                    
		                    <p><strong>"대화의 중요성과 포용력 "</strong></p>
		                    <p>학부생 시절, 교내 학술제 입상을 목표로 프로젝트를 진행한 경험이 있습니다. 이때 팀원과의 갈등을 해결하는 것이 가장 힘든 경험이었습니다.</p>
		                    <p>3주간의 짧은 프로젝트 기간에 설계부터 서비스까지 완성해야 하는 촉박한 일정이었습니다. 그때 '회원가입' 기능을 담당하는 A 팀원의 작업속도가 느려 다른 팀원의 연계작업이 지체되는 상황이 발생하였습니다. 각 팀원은 각자의 불만을 이야기하며 프로젝트가 진행되지 않았습니다.</p>
		                    <p>해당 문제를 해결하기 위해 가장 필요한 건 팀원 간의 신뢰와 협업이라고 생각했습니다.</p>
		                    <p>첫 번째로 유대관계를 형성하기 위해 노력했습니다. 팀원 간의 신뢰가 부족한 까닭은 각각의 팀원들이 서로의 성향을 파악하지 못하기 때문에 생긴 문제라고 생각했습니다. 
개인적인 이야기와 더불어 서로가 부족한 점에 대해서도 물어보며 고쳐나가야 할 것들에 관해서 대화를 나누었습니다. 각자의 성향을 파악하며 점차 신뢰가 쌓이기 시작했습니다.</p>
		                    <p>두 번째로 협업을 통해 프로젝트 진행속도를 향상했습니다.
A 팀원의 작업속도가 느린 이유는 부족한 부분에 대해 표출하지 못하였기 때문이었습니다. 또한, 팀원들의 소극적인 태도 문제도 있었습니다. 대화를 통해 가까워진 팀원들은 본인의 역할이 끝나고 손이 부족한 팀원들에게 도움을 주며, 작업속도를 향상할 수 있었습니다.</p>
		                    <p>이러한 노력 끝에 남은 작업들을 마무리할 수 있었습니다. 그 결과, 학술제에서 동상을 받으며 입상을 할 수 있게 되었고 마음이 맞아 다른 프로젝트까지 함께 할 수 있었습니다.</p>
		                    <p>이 경험을 통해 대화의 협업과 중요성을 깨달았습니다. 아무리 뛰어난 사람들이 모여있어도 각자의 이익만 추구한다면 집단으로서 목표를 달성할 수 없다는 교훈을 얻었습니다. 제가 귀사의 일원이 된다면 팀원으로서 소통과 협업을 통해 회사의 목표에 이바지하고 싶습니다.</p>



		                    <hr/>
		                    <p><span>4. 지원분야에 있어 가장 중요한 실무역량은 무엇인지, 그리고 역량을 키우기 위해 어떤 노력을 해 왔는지 기술하여 주십시오.</span></p>
		                    <p><strong>"적극적인 인재로 성장하기 위해"</strong></p>
							<p>IT 개발 직무의 중요 역량은 적극성이라고 생각합니다. 적극적으로 역량을 향상하며 맡은 업무를 수행함에 따라 시스템의 안정성 유지, 효율적인 개발, 나아가 사업의 성공까지 이룰 수 있습니다. 적극성이 없다면 더 이상의 성장은 없다고 생각합니다.</p>
							<p>저의 역량점수는 80점이라고 생각합니다. 소심하고 수동적인 성격을 고치기 위해 노력한 결과라고 생각합니다. 학부생 시절에는 학생회 활동을 지원했습니다. 부학생회장에 선출되어 적극적으로 교내 봉사활동, 학과 행사를 진행하며 성공적으로 이끈 경험이 있습니다.</p>
							<p>전 직장에서도 적극적으로 업무에 참여한 경험이 있습니다. 당시 ERP를 담당하고 있었습니다. 사용자들은 한 건의 결재를 위해서 두 번의 작업을 진행해야 했습니다. 사용자들은 불편을 느끼며 호소했지만, 정작 임원진, 팀장님은 그 문제를 심각하게 생각하지 않았습니다.</p>
							<p>문제를 파악해보니 충분히 개선 가능한 문제였습니다.자투리 시간에 불필요한 JSP와 JAVA 파일을 찾아 정리하였습니다. 이를 바탕으로 필요한 시간과 작업량에 대해 정리하였고 적극적으로 개선 의지를 나타냈습니다.</p>
							<p>정리된 정보를 검토한 팀장님은 시스템 수정 작업의 양이 적다는 것을 인식했고, 수정 요청이 받아들여지게 되었습니다. 이후 개편을 통해 많은 사용자가 만족하였습니다. 더불어 저에 대한 신뢰도가 향상되었습니다.</p>
							<p>이처럼 적극적인 행동은 개발자로서의 역량을 향상해줄 뿐만 아니라 주변 관계까지 도움을 주는 일이 많았습니다. 남은 20점을 귀사에서 채워나가며 동반자로서 함께 성장하고 싶습니다.</p>




							<hr/>
		                    <p><span>5. 본인의 강점과 약점을 언급하시고, 그 강점이 앞으로 귀사와 본인의 발전에 어떻게 기여 할 수 있는지를 서술해주십시오</span></p>
		                    <p><strong>"간단한 정리, 효율성을 높이다"</strong></p>
		                    <p>저는 틈틈이 메모하며 정리하고 복습하는 습관을 갖고 있습니다. 이 습관으로 인해 한번 경험했던 것들에 대해 더욱 빠른 해결이 가능하며 남다른 정보력을 가진 것이 강점입니다. </p>
		                    <p>업무 시엔 업무 내용, 지시사항, 참고할만한 기술 등 그날 있었던 일들을 시간이 날 때마다 정리합니다. 여러 가지 정보를 바탕으로 업무를 효율적으로 처리하며, 예기치 못한 상황이 발생할 때 작은 도움이라도 받을 수 있었습니다. 매일 귀찮을 수도 있지만 쌓여가는 정보의 양을 보면 성취감을 느끼게 해줍니다.</p>
		                    <p>이 강점을 향후 SW 개발을 하며 목표를 달성하는 데 활용하겠습니다. 업무현장에서 발생한 경험을 일목요연하게 정리하여 활용한다면 시스템 유지보수 및 관리할 때에 많은 도움이 될 것입니다. 또한, 신규 시스템 개발 시 기존 정보를 활용하며 더욱 빠르고 효율적인 개발이 가능할 것입니다. 그로 인해 시간을 단축한다면 진행 중인 사업의 성공에 한 걸음 더 다가갈 수 있을 것입니다.</p>
		                    <p>단점으로는 빠른 의사결정의 부재입니다. 최선의 결과를 위해 다양한 생각에 빠지다 보니 빠른 결정에 문제가 생길 때가 있기 때문입니다. 이 점을 극복하기 위해 혼자만의 생각에 빠지지 않으려고 주의합니다. 주변의 의견을 물어보며 수렴하고, 최고의 선택을 하기 위해 활용합니다. 또한, 항상 적극적인 의사 표현과 능동적이고 행동력 있는 자세를 지향하려 노력 중입니다.</p>
		                    

		         			<hr/>
		                    <p><span>6. 앞으로 10년 안에 가장 크게 이루고 싶은 부분은 무엇이며, 이를 위해 준비하거나 거쳐가야 할 과정이 있다면 서술해주십시오. 또한 현재 진행 중인 것이 있다면 기술해주십시오.</span></p>
		                    <p><strong>"정보력을 갖춘 개발자로서 도약"</strong></p>
		                    <p>저는 향후 개발자로서 블로그나 개인홈페이지를 운영하며 다른 사람들이 참조할 수 있는 정보를 제공하는 것이 목표입니다. 정보를 제공하기 위해 확실하게 제 것으로 만드는 능력을 키울 수 있습니다. 또한, 다양한 사람들과 함께 고민하며 의견을 나누며 역량을 키울 수 있기 때문입니다.</p>
		                    <p>이 목표를 달성하기 위해서는 크게 두 가지 과정이 필요하다고 생각합니다.</p>
		                    <p>첫째. 자만하지 않고 탐구하는 습관을 지녀야 합니다. 
프로그래밍에 필요한 기술은 다양합니다. 안정적이고 효율적인 방법을 탐구하며 현 상황에 맞는 최적의 기술을 찾아 활용할 줄 알아야 합니다. 기존에 사용하던 기술을 완벽하게 아는 것은 중요합니다. 하지만 개발자로서 여러 기술에 대한 안목과 활용능력 또한 필요하다고 생각합니다. 기존의 내용을 자신의 것으로 만들며, 새로운 기술을 끊임없이 탐구하는 모습이야말로 성장하는 개발자의 모습이라고 생각합니다.</p>
		                    <p>둘째. 개발자로서 글로벌 마인드를 갖춰야 합니다.
공부나 업무처리 시 다양한 검색엔진을 활용하여 많은 도움을 받곤 합니다. 필요한 정보를 찾기 위해서 국내뿐만 아니라 해외의 정보들을 활용한다면 더 많은 정보를 얻을 수 있습니다. 그렇게 하려면 영문으로 된 문서들을 읽고 활용하는 연습을 꾸준히 해야 합니다.</p>
		                    <p>현재는 이 목표를 이루기 위한 첫단계로서 세계적인 CVS시스템인 GITHUB의 사용법과 활용법을 공부하며 이용하고 있습니다. 다양한 소스코드를 구경하고 본인이 만든 소스를 올리며 사용법에 대해 익숙해지려고 노력 중입니다. 이 시스템에 익숙해진다면 전 세계 개발자들과 정보를 공유하고 도움을 주고받으며 개발자로서의 역량을 향상하는 데 많은 도움이 될 것입니다.</p>
		                               
		               </div>
		               
		               
		               

		               
		               
		               
		               <div class="modal-footer">
		                    <button type="button" class="btn btn-default" data-dismiss="modal">닫기</button>
<!-- 		                    <button type="button" class="btn btn-primary">자기소개서 받기<small>(PDF)</small></button> -->
		               </div>
		          </div>
		     </div>
			</div>
          <!-- Modal -->
          
          
        </div>
        <!--/.row -->
      </div>
      <!--/.container -->
    </div>
    <!--/ #intro -->
  </section>


 